每天学习10个面试题

面试题1：介绍ASP.NET

ASP.NET不是一种语言，而是创建动态Web的一种强大的服务器端技术，它是微软.NET Framework中一套用于生成Web
应用程序和Web服务的技术，利用公共语言运行时在服务器后端为用户提供建立强大的企业级Web应用服务的编程框架。

面试题2：介绍ASP.NET和ASP的区别

都是微软公司的两项web技术，但是由于诞生的时间与背景不同，所以区别相对较大，主要区别在于开发语言，运行机制，
运行环境，开发方式的不同

面试题3：说明ASP.NET的Application特性

Application对象在实际网络开发中的用途就是记录整个网络的信息，在应用程序的多用户之间共享信息，并在服务器运行
期间持久的保存数据。Application对象具备控制访问应用层数据的方法，并可用于在应用程序启动和停止时触发过程的事
件。

面试题4：简述ASP.NET的页面运行机制

当每次请求ASP.NET页面时，依据不同的情况，浏览器，服务器，ASP.NET引擎之间将执行这4条路线中的一条路线。

面试题5：简述ASP.NET一个页面的生命周期

对象初始化，加载视图状态数据，LoadPostData处理回传数据，对象加载，激发RaisePostDataChanged事件，处理客户端回传事件
对象预呈现，保存视图状态，呈现html，释放

面试题6：C#中的托管代码是什么

面试题7：C#中的非托管代码是什么

面试题8：IL语言如何在.NET下运行

面试题9：如何使用实时编译进行代码优化

面试题10：什么事.NET 中的私有程序集
































